# MinimumWidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePaneState..::..MinimumWidth Property
DockablePaneState Class See Also
---
When %dockPosition% is anything other than floating, the minimum width to use for the pane. Default is 200 pixels.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public int MinimumWidth { get; set; }
```

Visual Basic
---
```text
Public Property MinimumWidth As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int MinimumWidth {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for minimumWidth is not positive. |

# See Also
DockablePaneState Class
Autodesk.Revit.UI Namespace